# Домашнее задание №2. Классы.
# Цель: в этом ДЗ написать базовый класс и сделать главный модуль,
# при запуске которого выполняется демонстрация работы всех классов.

# 1. Написать базовый класс для средства передвижения, определить у него общие свойства.Например, вес, грузоподъемность.
# 2. Определить общие методы, например “издать звук”.
# 3. Сделать несколько наследников класса. Например: корабль, автомобиль, самолёт.
# 4. Перегрузить у них методы, чтобы соответствовать классу.
# 5. Также добавить свойства, относящиеся к классу: водоизмещение, количество колёс, предельная высота и т.д.
# 6. Базовые классы должны быть реализованы асбстрактными классами при помощи модуля abc.
# 7. Создать более конкретные классы. Например: “легковой автомобиль”, “парусная лодка” и тд.
# 8. Перегрузить общие свойства, а также добавить дополнительные свойства и методы.
# 9. Разнести все классы и исключения в отдельные модули.
# 10. Добавить методы, которые принимают параметры.
# 11. Добавить в инициализатор и другие методы классов выкидывание исключения при передаче неподходящих аргументов,
# или не выполнении других внутренних условий (например, если бак пустой,
# то при попытке “завести” ТС будет выкинуто исключение, что недостаточно топлива).
# 12. Можно создать вспомогательные объекты при помощи датаклассов. Например, объект “двигатель”,
# у которого есть несколько свойств: литраж, количество поршней, максимальное количество оборотов.
# 13. Сделать главный модуль, при запуске которого выполняется демонстрация работы всех классов
# (красивые принты с использованием print приветствуются).
